cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'emacs-mac'
brew 'macvim'

brew 'ack'
brew 'aliases'
brew 'asciidoc'
brew 'autoconf'
brew 'automake'
brew 'bash-completion'
brew 'coreutils'
brew 'cocoapods'
brew 'ctags'
brew 'dnsmasq'
brew 'erlang'
brew 'elixir'
brew 'gettext'
brew 'go'
brew 'grc'
brew 'git'
brew 'heroku'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'lastpass-cli'
brew 'libxml2'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'r'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'readline'
brew 'sbt'
brew 'scala'
brew 'scalastyle'
brew 'spaceman-diff'
brew 'swiftlint'
brew 'tern'
brew 'the_silver_searcher'
brew 'tmux
brew 'tree
brew 'unrar'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'zsh-extensions'

cask 'atom'