cask_args appdir: '/Applications'

tap 'homebrew/bundle'

cask 'alfred'
cask 'atom'
cask 'beyond-compare'
cask 'blender'
cask 'dash'
cask 'docker'
cask 'emacs'
cask 'evernote'
cask 'focus-booster'
cask 'graphiql'
cask 'insomnia'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'java'
cask 'kindle'
cask 'macdown'
cask 'monodraw'
cask 'paw'
cask 'rstudio'
cask 'sketch'
cask 'sourcetree'
cask 'spectacle'
cask 'sqlpro-for-mysql'
cask 'spotify'
cask 'xmind'
cask 'xquartz'
cask 'zeplin'

brew 'ack'
brew 'asciidoc'
brew 'autoconf'
brew 'automake'
brew 'bash-completion'
brew 'coreutils'
brew 'cocoapods'
brew 'carthage'
brew 'ctags'
brew 'dnsmasq'
brew 'erlang'
brew 'elixir'
brew 'geoip'
brew 'gettext'
brew 'go'
brew 'grc'
brew 'git'
brew 'graphviz'
brew 'heroku'
brew 'hub'
brew 'imagemagick@6', args: ['with-qauntum-depth-8']
brew 'jp2a'
brew 'jq'
brew 'lastpass-cli', args: ['with-pinentry']
brew 'libxml2'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'ibressl'
brew 'macvim'
brew 'markdown'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'nodenv'
brew 'node-build'
brew 'openssl'
brew 'postgresql'
brew 'r'
brew 'redis'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'readline'
brew 'sbt'
brew 'scala'
brew 'scalastyle'
brew 'swiftlint'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'v8'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
